app/views/channels/show.html.erb

SELECT "channels".* FROM "channels" INNER JOIN "follows" ON "channels"."id" = "follows"."channel_id" WHERE "follows"."user_id" = ?  [["user_id", 980190962]]
---
        <p class="card-text"><%= @channel.about %></p>
        <% if @current_user.channels.include?(@channel) %>