app/views/users/main.html.erb

    <% if session[:user_id] != nil %>
    <% if Tag.find_by(user_id:@current_user.id) != nil %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ? LIMIT ?  [["user_id", 980190962], ["LIMIT", 1]]

        <td>
          <% if Tag.find_by(user_id:@current_user.id,tag_name:'FPS')!=nil %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ? AND "tags"."tag_name" = ? LIMIT ?  [["user_id", 980190962], ["tag_name", "FPS"], ["LIMIT", 1]]