app/views/videos/select_tag.html.erb

            <a href="/tag/?name_tag=FPS" class="btn btn-primary" id="fortest_findvideo">Find Video</a>
            <% if Tag.find_by(user_id:@current_user.id,tag_name:'FPS')==nil %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ? AND "tags"."tag_name" = ? LIMIT ?  [["user_id", 980190962], ["tag_name", "FPS"], ["LIMIT", 1]]