app/controllers/channels_controller.rb

  def show
    @current_user = User.find_by(id:session[:user_id])
    @channel_followed= @current_user.channels
    @channel = Channel.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def all_channel
    @channels = Channel.all
    @current_user = User.find_by(id:session[:user_id])
---
SELECT "channels".* FROM "channels"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def follow
    @channel = Channel.find_by(id:params[:id])
    @current_user = User.find_by(id:session[:user_id])
    @new_follow = Follow.new(user_id:@current_user.id,channel_id:@channel.id)
    @new_follow.save
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
INSERT INTO "follows" ("user_id", "channel_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 980190962], ["channel_id", 980190962], ["created_at", "2021-12-13 10:09:29.350732"], ["updated_at", "2021-12-13 10:09:29.350732"]]

  def unfollow
    @channel = Channel.find_by(id:params[:id])
    @current_user = User.find_by(id:session[:user_id])
    @destroy = Follow.find_by(user_id:@current_user.id,channel_id:@channel.id)
    @destroy.destroy
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."channel_id" = ? LIMIT ?  [["user_id", 980190962], ["channel_id", 980190962], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 980190962]]