app/controllers/users_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."user_id" = ? LIMIT ?  [["user_id", 980190962], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ? LIMIT ?  [["user_id", 980190962], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def main
    if session[:user_id]== nil
      redirect_to login_path
    end
    @channel= Channel.find_by(user_id:session[:user_id])
    @follow_tag = Tag.where(user_id:session[:user_id])
    @current_user = User.find_by(id:session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test1"], ["LIMIT", 1]]
---
  def check_login
    @email = params[:email]
    @password = params[:password]
    @user = User.find_by(email:@email)

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save