app/controllers/videos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def select_tag
    if session[:user_id]== nil
      redirect_to login_path
    end
    @current_user = User.find_by(id:session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."tag" = ?  [["tag", "FPS"]]
---
  def show_tag
    if session[:user_id]== nil
      redirect_to login_path
    end
    @current_user = User.find_by(id:session[:user_id])
    if @current_user != nil
    @channel_followed= @current_user.channels
    end
    @allvideo = Video.where(:tag => params[:name_tag])